excepted outpoot:

azurerm_resource_group.myfirstRG: Refreshing state... [id=/subscriptions/d18efcbe-caa9-4004-ac2c-7312261e11de/resourceGroups/myRG]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the last "terraform apply":

  # azurerm_resource_group.myfirstRG has changed
  ~ resource "azurerm_resource_group" "myfirstRG" {
        id       = "/subscriptions/d18efcbe-caa9-4004-ac2c-7312261e11de/resourceGroups/myRG"
        name     = "myRG"
      + tags     = {}
        # (1 unchanged attribute hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the relevant attributes using ignore_changes, the following
plan may include actions to undo or respond to these changes.

────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following
symbols:
  + create

Terraform will perform the following actions:

  # azurerm_public_ip.myfirstIP will be created
  + resource "azurerm_public_ip" "myfirstIP" {
      + allocation_method       = "Static"
      + availability_zone       = (known after apply)
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "westeurope"
      + name                    = "MyFirstIP"
      + resource_group_name     = "myRG"
      + sku                     = "Basic"
      + sku_tier                = "Regional"
      + zones                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Saved the plan to: main.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "main.tfplan"

